In [2]:
import pandas as pd
data = pd.read_csv('./titanic-parquet.tsv', sep = '\t')

***DATAFRAME AND SERIES***

create DataFrame :

In [3]:
status = pd.DataFrame({'Name' : data.Name,
                       'Survived' : data.Survived,
                       'Fare' : data.Fare}, 
                       index = data.PassengerId)

***PANDAS - INDEXING, SELECTING AND ASSIGNING***

ILOC and LOC :        
    iloc : ***data.iloc[index]*** : trả về HÀNG thứ <index+1>  
    loc : ***data.loc[column name]*** : giống như iloc nhưng dùng tên cột hoặc tên hàng

***KHI NÀO DÙNG LOC, ILOC***   
Dùng loc sẽ trả về [], dùng iloc trả về [)  
Dùng loc khi index **categorical type**, dùng iloc với **numeric type**

In [4]:
status.iloc[2, :] # hàng có index thứ 2, là hành khách số 3, hiển thị toàn bộ thông tin (mọi cột)

Name        Futrelle, Mrs. Jacques Heath (Lily May Peel)
Survived                                             1.0
Fare                                                53.1
Name: 3, dtype: object

In [5]:
status.loc[3, ['Survived', 'Fare']] # hiển thị hành khách có PassengerId (cột được chọn làm index) là 3, hiển thị 2 thông tin

Survived     1.0
Fare        53.1
Name: 3, dtype: object

In [6]:
status.loc[1, 'Name']

'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'

***INDEX MANIPULATING***

***set_index(column)*** mang cột đó thành index

In [7]:
status.set_index('Name').head()

                                                    Survived     Fare
Name
Cumings, Mrs. John Bradley (Florence Briggs Tha...       1.0  71.2833
Heikkinen, Miss. Laina                                   1.0   7.9250
Futrelle, Mrs. Jacques Heath (Lily May Peel)             1.0  53.1000
Allen, Mr. William Henry                                 0.0   8.0500
Moran, Mr. James                                         0.0   8.4583

***CONDITIONAL SELECTION***  
This operation produced a Series of True/False booleans based on the country of each record.  
 This result can then be used inside of loc to select the relevant data:

In [8]:
data.loc[(data.Sex == 'female'), ['Name', 'Fare', 'Survived']].head(4)

                                                Name     Fare  Survived
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833         1
2                             Heikkinen, Miss. Laina   7.9250         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000         1
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  11.1333         1

In [9]:
data.loc[[1,2,4,6,8], ['Name', 'Sex', 'Fare']]

                                                Name     Sex     Fare
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  71.2833
2                             Heikkinen, Miss. Laina  female   7.9250
4                           Allen, Mr. William Henry    male   8.0500
6                            McCarthy, Mr. Timothy J    male  51.8625
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  11.1333

***NESTING***

In [10]:
data.loc[(data.Sex == 'male') & (data.Survived == 1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
17,18,1,2,"Williams, Mr. Charles Eugene",male,\N,0,0,244373,13.0000,\N,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28,0,0,113788,35.5000,A6,S
36,37,1,3,"Mamee, Mr. Hanna",male,\N,0,0,2677,7.2292,\N,C
55,56,1,1,"Woolner, Mr. Hugh",male,\N,0,0,19947,35.5000,C52,S

In [11]:
data.loc[data.Age.isnull()].sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare           0.0
Cabin            0
Embarked         0
dtype: object

In [12]:
data['test'] = 'yes'
data.loc[:, 'test'].head()

0    yes
1    yes
2    yes
3    yes
4    yes
Name: test, dtype: object

In [13]:
status['index'] = range(1, len(status)+1)
status.head()

,Name,Survived,Fare,index
PassengerId,,,,
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1.0,71.2833,1
2,"Heikkinen, Miss. Laina",1.0,7.9250,2
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1.0,53.1000,3
4,"Allen, Mr. William Henry",0.0,8.0500,4
5,"Moran, Mr. James",0.0,8.4583,5

***SUMMARY FUNCTIONS AND MAPS***

**SUMMARY FUNCTIONS**  
Là những hàm trả về thông tin của DataFrame  
Đối với dạng dữ liệu số sẽ trả về các thống kê trên toàn bảng  
Đối với dạng dữ liệu phân loại sẽ trả về như sau :

In [14]:
data.Sex.describe()

count      891
unique       2
top       male
freq       577
Name: Sex, dtype: object

In [15]:
data['Fare'].mean()

np.float64(32.204207968574636)

***nunique và unique***

In [16]:
data['Sex'].unique()

array(['male', 'female'], dtype=object)

In [17]:
x = data.nunique() # gọi data về cơ bản là gọi data[:, :]

***value_counts()***  
Trả vể list các biến duy nhất và tần suất xuất hiện

In [18]:
VC = data['Pclass'].value_counts()

***MAPS***  
map is a function used for transforming data to another type or representation

In [19]:
data.Fare.head()

0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
Name: Fare, dtype: float64

Cách hoạt động của map : nó sẽ iterate qua từng phần tử của data (*or so-called ánh xạ*)  
sau đó tùy vào dữ liệu mà nó nhận gồm hàm / dict / Series mà sẽ biến đổi data thành phương thức được truyền vào

In [20]:
mean_fare = data.Fare.mean()
data['Fare'] = data.Fare.map(lambda x : x - mean_fare)
data.Fare.head()

0   -24.954208
1    39.079092
2   -24.279208
3    20.895792
4   -24.154208
Name: Fare, dtype: float64

Ở đây khi dùng data.Fare.map, map sẽ ánh xạ từng phần tử của data.Fare vào biến x, với mỗi x  
sẽ trừ đi mean_fare, cuối cùng trả về 1 Series  

Bên dưới là ví dụ chuyển giới tính về 0 và 1 dùng map. Nhanh hơn LabelEncoder và trực quan hơn

In [21]:
data['Sex'] = data.Sex.map(lambda x : 1 if (x=='male') else 0)
data['Sex'].head()

0    1
1    0
2    0
3    0
4    1
Name: Sex, dtype: int64

***APPLY***  
Áp dụng hàm trong apply cho mọi giá trị trong Series (mặc định axis = 1)  
Nếu áp dụng cho cột, dùng axis = 0

In [22]:
data.Sex = data['Sex'].apply((lambda x : 'male' if (x==1) else 'female'))
data['Sex'].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [23]:
df = pd.DataFrame({'A':[1,2], 'B':[3,4]})
df_sum = df.apply(sum, axis=1)  # tính tổng từng hàng
df_sum

0    4
1    6
dtype: int64

In [24]:
df['Total'] = df.apply(lambda row: row['A'] + row['B'], axis=1)
df

   A  B  Total
0  1  3      4
1  2  4      6

Có thể đơn giản meaning bằng cách dùng data['Fare'] - mean_fare  
Và cũng có thể đơn giản gộp 2 Series lại với nhau : data['Name'] + '-' + data['Age']

In [25]:
data['NA'] = data['Name'] + '-' + data['Age']
data.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,NA
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,-24.954208,\N,S,yes,"Braund, Mr. Owen Harris-22"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,39.079092,C85,C,yes,"Cumings, Mrs. John Bradley (Florence Briggs Th..."

**FILL NA CHO DATAFRAME**

In [26]:
import numpy as np
data['Age'] = data.Age.replace(r'\N', np.nan)

In [27]:
data['Age'] = pd.to_numeric(data['Age'])

***GROUPING AND SORTING***

***GROUPBY() FUNCTION***  
dùng để chia dữ liệu theo nhóm dựa trên giá trị của một hay nhiều cột, sau đó có thể áp dụng các phép toán tổng hợp (aggregation), biến đổi (transformation), hoặc lọc (filter) trên từng nhóm riêng biệt.

In [28]:
data['Age'] = pd.cut(data['Age'], bins= [0,20,30,40,60,100], labels = ['tre', 'thanh nien', 'truong thanh', 'trung nien', 'gia'])

In [29]:
data.groupby('Age').Age.count()

C:\Users\MSI VN\AppData\Local\Temp\ipykernel_5720\3631278127.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  data.groupby('Age').Age.count()

Age
tre             179
thanh nien      230
truong thanh    155
trung nien      128
gia              22
Name: Age, dtype: int64

Groupby trả về 1 kiểu dữ liệu riêng, và sẽ chỉ thực thi khi được gọi hàm mean(), sum(), count(),...
Đối với lệnh data.groupby('Age').Age.count() sẽ tạo 1 groupby type, cột được group là Age, giới hạn 
dataframe lại theo Age, và áp dụng hàm count cho từng nhóm

In [30]:
data.groupby('Age')['Fare'].mean() #group số tuổi của hành khách sau đó tính mean Fare

C:\Users\MSI VN\AppData\Local\Temp\ipykernel_5720\3972973928.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  data.groupby('Age')['Fare'].mean() #group số tuổi của hành khách sau đó tính mean Fare

Age
tre             -2.351134
thanh nien      -3.897489
truong thanh    10.291892
trung nien      10.144037
gia              9.167006
Name: Fare, dtype: float64

In [31]:
data.loc[data['Survived'] == 0].groupby(['Age'])['Survived'].count()
#lọc ra những người đã chết -> group lại theo nhóm -> thông tin là Survived -> đếm số lượng mỗi nhóm

C:\Users\MSI VN\AppData\Local\Temp\ipykernel_5720\3015443280.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  data.loc[data['Survived'] == 0].groupby(['Age'])['Survived'].count()

Age
tre              97
thanh nien      146
truong thanh     86
trung nien       78
gia              17
Name: Survived, dtype: int64

In [32]:
des = data.groupby(['Age']).Fare.agg([len, min, max])

C:\Users\MSI VN\AppData\Local\Temp\ipykernel_5720\3062997515.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  des = data.groupby(['Age']).Fare.agg([len, min, max])
C:\Users\MSI VN\AppData\Local\Temp\ipykernel_5720\3062997515.py:1: FutureWarning: The provided callable <built-in function min> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  des = data.groupby(['Age']).Fare.agg([len, min, max])
C:\Users\MSI VN\AppData\Local\Temp\ipykernel_5720\3062997515.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  des = data.groupby(['Age']).Fare.agg([len, min, max])

Nếu là value_counts() thì nó chỉ đếm được số giá trị nằm trong cột được chọn, còn groupby có thể
đếm được số lượng thuộc tính này ứng với thuộc tính khác, ở đây là số province ứng với mỗi country

***SORTING***

In [33]:
data.sort_values(by=['Age'], ascending = False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,NA
438,439,0,1,"Fortune, Mr. Mark",male,gia,1,4,19950,230.795792,C23 C25 C27,S,yes,"Fortune, Mr. Mark-64"
252,253,0,1,"Stead, Mr. William Thomas",male,gia,0,0,113514,-5.654208,C87,S,yes,"Stead, Mr. William Thomas-62"
456,457,0,1,"Millet, Mr. Francis Davis",male,gia,0,0,13509,-5.654208,E38,S,yes,"Millet, Mr. Francis Davis-65"
96,97,0,1,"Goldschmidt, Mr. George B",male,gia,0,0,PC 17754,2.449992,A5,C,yes,"Goldschmidt, Mr. George B-71"
555,556,0,1,"Wright, Mr. George",male,gia,0,0,113807,-5.654208,\N,S,yes,"Wright, Mr. George-62"

***TYPE AND DATA***

**dtype** : trả về kiểu dữ liệu của 1 cột

In [40]:
data.Sex.dtype

dtype('O')

In [42]:
data.dtypes

PassengerId       int64
Survived          int64
Pclass            int64
Name             object
Sex              object
Age            category
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked         object
test             object
NA               object
dtype: object

**astype(<type>)** chuyển đổi kiểu dữ liệu

In [44]:
data.Fare.dtype

dtype('float64')

In [45]:
data.Fare.astype('int64')

0     -24
1      39
2     -24
3      20
4     -24
       ..
886   -19
887    -2
888    -8
889    -2
890   -24
Name: Fare, Length: 891, dtype: int64

In [46]:
data.Fare.map(lambda x : float(x))

0     -24.954208
1      39.079092
2     -24.279208
3      20.895792
4     -24.154208
         ...
886   -19.204208
887    -2.204208
888    -8.754208
889    -2.204208
890   -24.454208
Name: Fare, Length: 891, dtype: float64

***MISSING DATA NaN***

In [71]:
len(data.loc[data.Age.isnull() == True])

177

In [52]:
data.iloc[5]

PassengerId                      6
Survived                         0
Pclass                           3
Name              Moran, Mr. James
Sex                           male
Age                            NaN
SibSp                            0
Parch                            0
Ticket                      330877
Fare                    -23.745908
Cabin                           \N
Embarked                         Q
test                           yes
NA             Moran, Mr. James-\N
Name: 5, dtype: object

***fillna()*** : đơn giản là thế

***replace(object, replacement)*** : đổi giá trị object thành replacement

In [63]:
data.replace(data.Survived[0], 1).iloc[0]

PassengerId                             1
Survived                                1
Pclass                                  3
Name              Braund, Mr. Owen Harris
Sex                                  male
Age                            thanh nien
SibSp                                   1
Parch                                   1
Ticket                          A/5 21171
Fare                           -24.954208
Cabin                                  \N
Embarked                                S
test                                  yes
NA             Braund, Mr. Owen Harris-22
Name: 0, dtype: object

***RENAMING AND COMBINING***

**RENAMING**  
rename(columns = {'**original name**' : '**desired name**'})

In [77]:
data.rename(columns = {'Sex' : 'Gender'})
data.set_index(data.PassengerId)
data.rename(index = {0:'first person',
                     1: 'second person'})
data.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,NA
0,1,0,3,"Braund, Mr. Owen Harris",male,thanh nien,1,0,A/5 21171,-24.954208,\N,S,yes,"Braund, Mr. Owen Harris-22"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,truong thanh,1,0,PC 17599,39.079092,C85,C,yes,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina",female,thanh nien,0,0,STON/O2. 3101282,-24.279208,\N,S,yes,"Heikkinen, Miss. Laina-26"

***rename_axis()*** : đặt tên cho hàng và cột  
rename_axis(**tên**, **axis** = 0/1)

In [83]:
data = data.rename_axis('Information', axis = 1).rename_axis('Index', axis = 0)
data.head(1)

Information,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,NA
Index,,,,,,,,,,,,,,
0,1,0,3,"Braund, Mr. Owen Harris",male,thanh nien,1,0,A/5 21171,-24.954208,\N,S,yes,"Braund, Mr. Owen Harris-22"

***COMBINING***

The simplest combining method is ***concat()***. Given a list of elements, this function will smush those elements together along an axis.  

*pd.concat([df1, df2])*

***FACTORIZE()***  
Mã hóa nhãn categorical thành dạng số

In [ ]:
from sklearn.preprocessing import OrdinalEncoder